{"signal":"SIGINT","users":{"notSeen":{"stats":{"Loyalty":0,"Strength":0,"Wisdom":0},"character":"Not seen","faction":"notSeen","isLeader":"notSeen","lastSeen":0,"passage":"Name Not Recognized","role":"notSeen","username":"notSeen"},"405918053226774538":{"role":"Tlacaelel","username":"dakota","discriminator":"1576","faction":"Aztecs","character":"Tlacaelel Xocoyotl (aka Tlacaelel the Younger)","isLeader":"FALSE","passage":"The Library","passageHistory":{"The Library":"The Library: \n <<theyr>> It's eight weeks into the semester and you're already drowning in work. You have your first exams this week, you need to get started on some research, and now your history professor has sprung a surprise assignment on you at the last minute--and it's due tomorrow! The only way you're going to get everything done is to pull an all-nighter. There's no way you'll be able to stay awake at home; your bed is there and it's just too tempting. So you head to the library. <br> <br> It's 7 pm and the library is more crowded than usual. It looks like you're not the only one with a mountain of work to do this week! There's no way you'll be able to focus in the midst of so many people. Maybe the top floor is quieter. You head upstairs towards the study carrels, but they're all taken. It's dead quiet up here, but there's nowhere to work. You begin wandering down unfamiliar hallways, poking your head into all the different rooms, but none of them work. You're beginning to get frustrated when you notice a door you've never seen before. It's tucked into an alcove in the very back corner of the building. You decide to check this one last spot before you give up and join the masses downstairs. <br> <br> The door sticks as you try to open it, but you can tell it's not locked. You give it a pull and it creaks open, revealing a tiny room piled high with books and a single, overstuffed chair. There's not a soul to be found. When you close the door behind you, you can't even hear the sound of the H-VAC that hums through the rest of the building. This is perfect. You can't believe your luck! <br> <br> You unload your books and make yourself comfortable--maybe a little too comfortable. You get to work on your assignment, but within a matter of minutes your eyes get heavy. You struggle to stay awake but it's impossible to focus. Maybe a ten-minute nap will help. You tell yourself that if you just get it out of your system, you'll be good to go for the rest of the night. You close your eyes and quickly slip into a deep sleep. <br> <br> Suddenly, <<link \"you're startled by a loud noise\" \"Character Identification\">><<storeSet $Spaniards_currentMap=1>><<storeSet $factions[\"Spaniards\"][\"stats\"][\"Strength\"] = 7>><<storeSet $Tlaxcalans_currentMap=1>><<storeSet $factions[\"Tlaxcalans\"][\"stats\"][\"Strength\"] = 7>><<storeSet $Aztecs_currentMap=1>><<storeSet $factions[\"Aztecs\"][\"stats\"][\"Strength\"] = 7>><</link>>!<br> <br> <</theyr>>"}},"379034594206285845":{"role":"Aztec_Priest","username":"ksiew","discriminator":"0","faction":"Aztecs","character":"Aztec Priest","isLeader":"FALSE","passage":"Character Identification"}},"factions":{"Aztecs":{"stats":{"Strength":7}},"Spaniards":{"stats":{"Strength":7}},"Tlaxcalans":{"stats":{"Strength":7}}},"lookup":{"Marina":"notSeen","Alvarado":"notSeen","Aguilar":"notSeen","Garrido":"notSeen","Olid":"notSeen","Cortes":"notSeen","Moctezuma":"notSeen","Tlacaelel":"405918053226774538","Cuauhtemoc":"notSeen","Aztec_Priest":"379034594206285845","Cacamatzin":"notSeen","Pochteca":"notSeen","Xicotencatl_Elder":"notSeen","Xicotencatl_Younger":"notSeen","Maxixcatl":"notSeen"},"Spaniards_currentMap":1,"Tlaxcalans_currentMap":1,"Aztecs_currentMap":1}